#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcp_resource.data.google_client_config.provider: Reading...
module.gcp_resource.data.google_container_cluster.my_cluster: Reading...
module.gcp_resource.data.google_client_config.provider: Read complete after 0s [id=projects/"off-net-dev"/regions/"northamerica-northeast1"/zones/<null>]
module.gcp_resource.google_container_cluster.my_cluster: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/clusters/java-rest-app]
module.gcp_resource.data.google_container_cluster.my_cluster: Read complete after 3s [id=projects/off-net-dev/locations/northamerica-northeast1/clusters/java-rest-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcp_resource.kubernetes_deployment.deployment will be created
  + resource "kubernetes_deployment" "deployment" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + name             = "java-rest-app-dev"
          + namespace        = "namespace-development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "3"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "java-rest-app-dev"
                }
            }

          + strategy {
              + type = "RollingUpdate"

              + rolling_update {
                  + max_surge       = "25%"
                  + max_unavailable = "0"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "java-rest-app-dev"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "northamerica-northeast1-docker.pkg.dev/off-net-dev/lendly-demo/spring-boot-rest-app:"
                      + image_pull_policy          = (known after apply)
                      + name                       = "spring-boot-rest-app"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 30
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/healthz"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 10
                          + period_seconds        = 5
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/healthz"
                              + port   = "8080"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "1"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "500m"
                              + "memory" = "256Mi"
                            }
                        }
                    }

                  + image_pull_secrets (known after apply)

                  + readiness_gate (known after apply)
                }
            }
        }
    }

  # module.gcp_resource.kubernetes_horizontal_pod_autoscaler_v2.java_rest_app_hpa will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "java_rest_app_hpa" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "java-rest-app-dev"
            }
          + name             = "java-rest-app-hpa-dev"
          + namespace        = "namespace-development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 3
          + min_replicas                      = 1
          + target_cpu_utilization_percentage = (known after apply)

          + behavior (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 80
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + api_version = "apps/v1"
              + kind        = "Deployment"
              + name        = "java-rest-app-dev"
            }
        }
    }

  # module.gcp_resource.kubernetes_namespace.env will be created
  + resource "kubernetes_namespace" "env" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "namespace-development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.gcp_resource.kubernetes_service.dev_service will be created
  + resource "kubernetes_service" "dev_service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-service"
          + namespace        = "namespace-development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "java-rest-app-dev"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "8080"
            }

          + session_affinity_config (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*